tap "heroku/brew"
tap "homebrew/services"
brew "gh"
brew "git"
brew "go"
brew "heroku"
brew "libpq"
brew "libyaml"
brew "mackup"
brew "mas"
brew "mise"
brew "mysql-client"
brew "openjdk"
brew "pipx"
brew "pmd"
brew "postgresql@18", restart_service: :changed
brew "redis"
brew "tig"
brew "vips"
brew "yarn"
brew "zstd"
cask "1password"
cask "betterdisplay"
cask "caffeine"
cask "discord"
cask "docker-desktop"
cask "github"
cask "google-drive"
cask "ha-menu"
cask "hiddenbar"
cask "homeassistant"
cask "keepingyouawake"
cask "meetingbar"
cask "microsoft-teams"
cask "rectangle"
cask "shureplus-motiv"
cask "slack"
cask "spotify"
cask "time-out"
cask "todoist-app"
cask "visual-studio-code"
cask "zoom"
mas "Okta Extension App", id: 1439967473
vscode "albert.tabout"
vscode "craigmaslowski.erb"
vscode "danileao.css-variables-autocomplete"
vscode "davidanson.vscode-markdownlint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "graphql.vscode-graphql-syntax"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "manuelpuyol.erb-linter"
vscode "marcoroth.herb-lsp"
vscode "mcright.auto-save"
vscode "miguel-savignano.ruby-symbols"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "patrykpeszko.vscode-proselint"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "tyriar.sort-lines"
vscode "will-wow.vscode-alternate-file"
vscode "wmaurer.change-case"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/dependabot/cli/cmd/dependabot"
go "github.com/gonejack/mhtml-to-html"
